NoneOfEver/hpm_support/include/dt-bindings/clock/hpm6e80-clocks.h
/*
 * Copyright (c) 2024-2025 HPMicro
 *SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6E80_CLOCKS_H
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6E80_CLOCKS_H

/*
 *
 *<---------------------- AUTO_GENERATE ---------------------->
 *    This file was auto-generated, do not edit anything.
 *    generated on 2025-10-20 16:16:33 
 */

#define CLK_SRC_OSC24M  0
#define CLK_SRC_PLL0_CLK0  1
#define CLK_SRC_PLL0_CLK1  2
#define CLK_SRC_PLL1_CLK0  3
#define CLK_SRC_PLL1_CLK1  4
#define CLK_SRC_PLL1_CLK2  5
#define CLK_SRC_PLL2_CLK0  6
#define CLK_SRC_PLL2_CLK1  7
#define CLK_SRC_OSC32K  8
#define CLK_ADC_SRC_ANA0  16
#define CLK_ADC_SRC_ANA1  16
#define CLK_ADC_SRC_ANA2  16
#define CLK_ADC_SRC_ANA3  16
#define CLK_ADC_SRC_AHB0  17
#define CLK_I2S_SRC_AUD0  32
#define CLK_I2S_SRC_AUD1  32
#define CLK_I2S_SRC_AUDN  32
#define CLK_I2S_SRC_AUDX  33
#define CLK_WDG_SRC_AHB0  48
#define CLK_WDG_SRC_OSC32K  49
#define CLK_PWDG_SRC_OSC24M  160
#define CLK_PWDG_SRC_OSC32K  161
#define CLK_SRC_INVALID  239

#define CLOCK_CPU0  0
#define CLOCK_MCHTMR0  17170433
#define CLOCK_CPU1  524290
#define CLOCK_MCHTMR1  17301507
#define CLOCK_AHB0  16777220
#define CLOCK_AXIF  4294901765
#define CLOCK_AXIS  16842758
#define CLOCK_AXIC  16908295
#define CLOCK_AXIN  16973832
#define CLOCK_GPTMR0  17367049
#define CLOCK_GPTMR1  17432586
#define CLOCK_GPTMR2  17498123
#define CLOCK_GPTMR3  17563660
#define CLOCK_GPTMR4  17629197
#define CLOCK_GPTMR5  17694734
#define CLOCK_GPTMR6  17760271
#define CLOCK_GPTMR7  17825808
#define CLOCK_I2C0  17891345
#define CLOCK_I2C1  17956882
#define CLOCK_I2C2  18022419
#define CLOCK_I2C3  18087956
#define CLOCK_I2C4  18153493
#define CLOCK_I2C5  18219030
#define CLOCK_I2C6  18284567
#define CLOCK_I2C7  18350104
#define CLOCK_SPI0  18415641
#define CLOCK_SPI1  18481178
#define CLOCK_SPI2  18546715
#define CLOCK_SPI3  18612252
#define CLOCK_SPI4  18677789
#define CLOCK_SPI5  18743326
#define CLOCK_SPI6  18808863
#define CLOCK_SPI7  18874400
#define CLOCK_UART0  18939937
#define CLOCK_UART1  19005474
#define CLOCK_UART2  19071011
#define CLOCK_UART3  19136548
#define CLOCK_UART4  19202085
#define CLOCK_UART5  19267622
#define CLOCK_UART6  19333159
#define CLOCK_UART7  19398696
#define CLOCK_UART8  19464233
#define CLOCK_UART9  19529770
#define CLOCK_UART10  19595307
#define CLOCK_UART11  19660844
#define CLOCK_UART12  19726381
#define CLOCK_UART13  19791918
#define CLOCK_UART14  19857455
#define CLOCK_UART15  19922992
#define CLOCK_CAN0  21561399
#define CLOCK_CAN1  21626936
#define CLOCK_CAN2  21692473
#define CLOCK_CAN3  21758010
#define CLOCK_CAN4  21823547
#define CLOCK_CAN5  21889084
#define CLOCK_CAN6  21954621
#define CLOCK_CAN7  22020158
#define CLOCK_XPI0  24051775
#define CLOCK_FEMC  24117312
#define CLOCK_ETH0  24444993
#define CLOCK_PTP0  24444994
#define CLOCK_NTMR0  24576067
#define CLOCK_REF0  24641604
#define CLOCK_REF1  24707141
#define CLOCK_TSN1  24772678
#define CLOCK_TSN2  24772679
#define CLOCK_TSN3  24772680
#define CLOCK_CRC0  19989504
#define CLOCK_TSNS  20055040
#define CLOCK_MBX0  20382720
#define CLOCK_MBX1  20448256
#define CLOCK_GPIO  20513792
#define CLOCK_PPI0  20579328
#define CLOCK_HDMA  20644864
#define CLOCK_LOBS  20710400
#define CLOCK_ACMP0  21038080
#define CLOCK_ACMP1  21103616
#define CLOCK_ACMP2  21169152
#define CLOCK_ACMP3  21234688
#define CLOCK_PTPC  22086656
#define CLOCK_MOT0  4294902784
#define CLOCK_QEI0  22152192
#define CLOCK_QEI1  22217728
#define CLOCK_QEI2  22283264
#define CLOCK_QEI3  22348800
#define CLOCK_QEO0  22414336
#define CLOCK_QEO1  22479872
#define CLOCK_QEO2  22545408
#define CLOCK_QEO3  22610944
#define CLOCK_PWM0  22676480
#define CLOCK_PWM1  22742016
#define CLOCK_PWM2  22807552
#define CLOCK_PWM3  22873088
#define CLOCK_RDC0  22938624
#define CLOCK_RDC1  23004160
#define CLOCK_SDM0  23069696
#define CLOCK_SDM1  23135232
#define CLOCK_PLB0  23200768
#define CLOCK_SEI0  23266304
#define CLOCK_MTG0  23331840
#define CLOCK_MTG1  23397376
#define CLOCK_VSC0  23462912
#define CLOCK_VSC1  23528448
#define CLOCK_CLC0  23593984
#define CLOCK_CLC1  23659520
#define CLOCK_EMDS  23725056
#define CLOCK_WATCHDOG0  20120320
#define CLOCK_WATCHDOG1  20185857
#define CLOCK_WATCHDOG2  20251394
#define CLOCK_WATCHDOG3  20316931
#define CLOCK_RNG  23791104
#define CLOCK_SDP  23856641
#define CLOCK_PKA  23922178
#define CLOCK_KMAN  23987715
#define CLOCK_XDMA  24315396
#define CLOCK_FFA0  24380933
#define CLOCK_ROM0  17040902
#define CLOCK_RAM0  24184064
#define CLOCK_RAM1  24249601
#define CLOCK_USB0  24512256
#define CLOCK_ESC0  24840192
#define CLOCK_LMM0  17107712
#define CLOCK_LMM1  17107968
#define CLOCK_PUART  4294904064
#define CLOCK_PTMR  4294904065
#define CLOCK_PWDG  4294904320
#define CLOCK_ANA0  4294901809
#define CLOCK_ANA1  4294901810
#define CLOCK_ANA2  4294901811
#define CLOCK_ANA3  4294901812
#define CLOCK_ADC0  20775168
#define CLOCK_ADC1  20840705
#define CLOCK_ADC2  20906242
#define CLOCK_ADC3  20971779
#define CLOCK_AUD0  4294901813
#define CLOCK_AUD1  4294901814
#define CLOCK_I2S0  21299712
#define CLOCK_I2S1  21365249
#define CLOCK_PDM  21430784
#define CLOCK_DAO  21496321
#define CLK_OSC0CLK0  2100480
#define CLK_PLL0CLK0  2231553
#define CLK_PLL0CLK1  2297090
#define CLK_PLL1CLK0  2428163
#define CLK_PLL1CLK1  2493700
#define CLK_PLL1CLK2  2559237
#define CLK_PLL2CLK0  2690310
#define CLK_PLL2CLK1  2755847
#define CLOCK_CMP0  CLOCK_ACMP0
#define CLOCK_CMP1  CLOCK_ACMP1
#define CLOCK_CMP2  CLOCK_ACMP2
#define CLOCK_CMP3  CLOCK_ACMP3


#endif  /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6E80_CLOCKS_H */
